{
  "CV": "Resume",
  "contact": "Contact",
  "about_this_proyect": "About This Project",
  "documents": "Documents",
  "images": "Images",
  "fileExplorer": "File explorer",
  "preferences": "Preferences",
  "wallpaper": "Wallpaper",
  "appearence": "Appearance",
  "language": "Language",
  "widgets": "Widgets",
  "en_language": "English",
  "es_language": "Spanish",
  "it_language": "Italian",
  "weather": "Weather",
  "details": "Details",
  "name": "Name",
  "email": "Email",
  "subject": "Subject",
  "send_message": "Send Message",
  "name_field_is_required": "Name is required",
  "email_field_is_required": "Email is required",
  "subject_field_is_required": "Subject is required",
  "invalid_email": "Invalid email",
  "loading": "Loading",
  "signIn": "Sign in",
  "logout": "Logout",
  "select_language": "Select language",
  "intro_content": {
    "paragraphs": {
      "1": "Hello! My name is Pablo Tilli",
      "2": "I am a fullstack web developer with over 20 years of experience.",
      "3": "I am dedicated to creating effective and attractive web solutions, and in this portfolio, I try to reflect my passion and dedication for what I do.",
      "4": "Turn on the light and",
      "5": "I hope you enjoy it!",
      "6": "I hope you are enjoying exploring my portfolio!",
      "7": "If you want to keep discovering more, you can go back to",
      "8": "log in",
      "9": "turn on the light to continue.",
      "10": "Turn on the light",
      "11": "and"
    }
  },

  "cv_content": {
    "sections": {
      "presentation": {
        "title": "PRESENTATION",
        "paragraphs": {
          "1": "My name is Pablo Tilli. I am a Senior Fullstack Developer with over 20 years of experience in developing comprehensive solutions for web, desktop, and mobile applications.",
          "2": "Expert in technologies such as HTML, CSS, JavaScript, React, and Node.js, as well as other key tools, with a strong focus on performance optimization and improving user experience."
        }
      },
      "work_experience": {
        "title": "WORK EXPERIENCE",
        "subtitle": "Some of my recent notable projects",
        "jobs": {
          "1": {
            "company": "Mercado Agroganadero de la República Argentina",
            "date": "(March 2020 - Present)",
            "role": "Software Analyst and Developer",
            "description": "The Mercado Agroganadero de la República Argentina handles the weekly transit of over 10,000 heads of cattle, being a fundamental pillar in the agricultural supply chain. It facilitates multi-million dollar transactions that directly impact the national economy. Additionally, it covers a vast logistics network that ensures the dispatch of cattle to different provinces across the country.",
            "responsibilities_title": "Responsibilities",
            "responsibilities": {
              "1": "I provide analysis and development services for robust and scalable solutions to modernize and create new projects that optimize the Market's management."
            },
            "technologies_title": "Technologies",
            "technologies": {
              "1": "Frontend: React, TypeScript, Styled Components, Chakra UI, Astro, Tailwind CSS, Next.js",
              "2": "Backend: Node.js, TypeScript, Express, TypeORM",
              "3": "Databases: MySQL, SQL Server, and MongoDB"
            },
            "achievements_title": "Impact and Key Achievements",
            "achievements": {
              "1": "I implemented a module for the registration, tracking, and generation of accident statistics, as well as for controlling video requests from security cameras. These modules have improved incident response capabilities, facilitating more efficient and transparent management of security and medical leave administration due to accidents.",
              "2": "I created a platform to display relevant information about indexes and sector data in real-time on various screens distributed throughout the Market's premises. This has significantly improved communication with visitors, allowing them to access updated data immediately, which enhances transparency and informed decision-making by participants.",
              "3": "I developed a dashboard that synthesizes a large amount of key variables for management, optimizing the decision-making process. This has considerably reduced response times and facilitated the Market's strategic direction, improving operational efficiency and adaptability to sector changes.",
              "4": "I implemented a real-time alert system that monitors key statistics on corral management, as well as visualizes statistics on cattle intake, transfer, and dispatch to different provinces. As a result, greater accuracy and control in logistics operations have been achieved, reducing errors and improving cattle management efficiency.",
              "5": "I developed a registration system for all employees and associates of the Market, generating a personalized dashboard according to permission levels (Administration, Management, Accounting, Systems, Maintenance, etc.). This system has improved information security and allowed each area to efficiently access relevant data for their management, optimizing workflows and internal collaboration."
            }
          },
          "2": {
            "company": "Membranding",
            "date": "January 2022 – March 2023",
            "role": "Analysis, Development, and Implementation of the Company’s Budgeting System",
            "description": "Membranding is a branding agency with a presence in Buenos Aires, New York, and Madrid, with extensive experience that has consolidated it as a benchmark in the sector, helping companies stand out in their respective markets.",
            "technologies_title": "Technologies",
            "technologies": {
              "1": "Frontend: Next.js, React, TypeScript, Tailwind.css",
              "2": "Backend: Node.js, TypeScript, Express",
              "3": "Databases: MySQL"
            },
            "responsibilities_title": "Responsibilities",
            "responsibilities": {
              "1": "I designed, developed, and implemented a comprehensive budgeting system, optimizing the quoting and budget management processes, achieving greater efficiency in project management, and complete visibility of each budget’s lifecycle."
            },
            "achievements_title": "Impact and Key Achievements",
            "achievements": {
              "1": "This solution led to a reduction in response time to clients and an improvement in the accuracy of quotes.",
              "2": "Greatly facilitated strategic decision-making based on historical data."
            }
          },
          "3": {
            "company": "Referencia Gastronómica S.A.",
            "date": "(April 2023 – June 2024)",
            "role": "Development and Deployment of a Web Platform and Mobile App",
            "description": "Referencia Gastronómica is a platform specifically designed for the gastronomic sector, considering the main needs of business owners and job seekers in this industry.",
            "technologies_title": "Technologies",
            "technologies": {
              "1": "Frontend: Next.js, React, React Native, Expo"
            },
            "responsibilities_title": "Responsibilities",
            "responsibilities": {
              "1": "Development of the web platform's frontend and the mobile application (Android).",
              "2": "I worked closely with a UX/UI, backend, and UX writing team to bring the project to the desired point for the client on time.",
              "3": "The website is divided into an institutional part and a management system for business owners in the gastronomic sector, allowing registered users to post job ads, track candidates, search for product and service suppliers, and rate them. Additionally, registered business owners can request references about potential candidates from other registered businesses. There is also an area where they can post news and products for sale, visible to other business owners on the site.",
              "4": "The mobile app is designed for job seekers in the sector. After registration, they can start following offers related to their interests, upload their CV to be contacted, and view statistics on the visibility of their profiles."
            },
            "achievements_title": "Impact and Key Achievements",
            "achievements": {
              "1": "The project required very tight development times, and I managed to implement it in even less time than expected.",
              "2": "Given the client's satisfaction with the web platform, I was also in charge of developing the mobile application for job seekers. Initially, the application was developed for Android, considering the target audience, but thanks to using React Native, it is open to the possibility of being easily ported to iOS."
            }
          },
          "4": {
            "company": "Course Teaching",
            "date": "(March 2018 – January 2020)",
            "description": "Sponsored by Telecom, Google, and JP Morgan through the Comunidad IT foundation, which has a presence in Argentina, Chile, and Canada, I trained hundreds of students in technologies such as React, Java, Node.js, and PHP.",
            "responsibilities_title": "Responsibilities",
            "achievements_title": "Impact and Key Achievements",
            "achievements": {
              "1": "My pedagogical approach, focused on practice and real project development, has enabled more than 50% of course participants to obtain employment in the IT sector, demonstrating the effectiveness of the training provided.",
              "2": "I managed to motivate high-potential students to overcome initial programming challenges, helping them develop the perseverance and confidence needed to complete the courses, and today they are integrated into the IT job market."
            }
          }
        }
      },
      "technical_skills_title": "TECHNICAL SKILLS",
      "languages": {
        "title": "LANGUAGES",
        "spanish_level": "Spanish: Native",
        "english_level": "English: Advanced Reading / Oral B1"
      },
      "higher_education_title": "HIGHER EDUCATION",
      "higher_education": {
        "1": {
          "degree": "Systems Analyst",
          "institution": "National University of Lujan"
        },
        "2": {
          "degree": "Advanced Programmer",
          "institution": "I.S.F.D. y T. Nº 189"
        }
      }
    }
  },
  "about_portfolio_content": {
    "sections": {
      "the_idea": {
        "title": "The Idea",
        "paragraphs": {
          "1": "Throughout my professional career, I have been in constant pursuit of new ways to innovate and showcase not only my technical skills but also my focus on user experience.",
          "2": "I have always believed that a portfolio should be more than just a simple collection of projects.",
          "3": "It was this combination of factors that led me to develop an interactive portfolio, offering a unique experience both on desktop and mobile devices.",
          "4": "I wanted something that not only showcased my work but engaged visitors in a more dynamic and immersive way. The idea was to bring the familiarity we all have with our own computers and phones, making navigation intuitive and, at the same time, enjoyable."
        }
      },
      "desktop_experience": {
        "title": "Desktop Experience",
        "paragraphs": {
          "1": "In the desktop version, users encounter an environment that replicates a desktop computer. Each section is represented as a different program that can be opened and explored.",
          "2": "From the very beginning, visitors see a desktop with icons representing each key section and a dock that facilitates navigation and gives the sensation of truly interacting with a computer. One of the 'programs' is my resume, where I have presented part of my professional background; in Documents, a PDF version of my resume can be viewed and downloaded, making it easy to have a physical or digital copy of my experience and skills. Another section is the image folder, where I have compiled pictures of various technologies I master, providing a quick view of my technical capabilities. Additionally, there is an icon on the desktop for contacting me.",
          "3": "I also wanted to offer the ability to customize the experience, including configuration options that allow changing the wallpaper, modifying the color scheme to suit different visual preferences, selecting the navigation language, and adding or removing desktop widgets (for now, only the weather, but I will keep adding new ones)."
        }
      },
      "mobile_experience": {
        "title": "Mobile Experience",
        "paragraphs": {
          "1": "When I thought about how to adapt this experience to mobile devices, I realized I needed an approach that maintained the core concept of interaction while also respecting the limitations and opportunities of smaller screens. Thus, in the mobile version, I transferred the desktop concept to an emulation of a phone interface. This not only preserves the idea of interactivity but also ensures that the portfolio is accessible and usable on any device, which is crucial in a world where mobile traffic continues to grow.",
          "2": "The mobile version offers simple navigation and retains the customization options, ensuring that users have a rich experience tailored to their preferences just like in the desktop version."
        }
      },
      "conclusion": {
        "title": "Conclusion",
        "paragraphs": {
          "1": "Through this portfolio, I not only wanted to showcase what I can do but also how I do it, highlighting my focus on user experience, adaptability, and the ability to transform ideas into digital products that are both functional and visually appealing."
        }
      },
      "technologies": {
        "title": "Technologies"
      }
    }
  }
}
